tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/0.orig/Ychar
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ychar;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mixed fresh-solid composition: char is one tenth of the inlet mass.
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    right
    {
        type            zeroGradient;
    }
    "(bottom|top|front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
