tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/0.orig/Ymineral
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version      2.0;
    format       ascii;
    class        volScalarField;
    location     "0";
    object       Ymineral;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0.4;
    }
    right
    {
        type            zeroGradient;
    }
    "(bottom|top|front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
