tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/0.orig/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The initial domain is empty of solid. A fully solid mixed stream enters at
// the left boundary and accumulates against the right wall. The inlet is
// intentionally dense but leaves gas volume for the coupled solve.
dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0.5;
    }
    right
    {
        type            zeroGradient;
    }
    "(bottom|top|front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
