tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/constant/pyrolysisProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Pyrolysis active so volPyrolysis::solveSpeciesMass() runs and transports the
// fresh solid from the left inlet by Us. With chemistry off the reaction source
// is zero, so the species equation is pure advection and accumulation.
active          true;

heterogeneousPyrolysisModel  volPyrolysis;

pyrolysisCoeffs
{
    subintegrateHeatTransfer false;
    bedCollapse      false;
    criticalPorosity 0.9999;
    replenish        false;

    // Solid arrives at porosity 0.5 and piles against the right wall, so the
    // first half of the run is inlet-driven filling and the receiver cap only
    // binds once the wall cells have packed down to 0.1.
    minPorosity      0.1;
    solidStateTolerance 1e-10;
    nSolidFluxLimiterCorrectors 8;
}

infoOutput      true;

// ************************************************************************* //
