tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/constant/reactions
species
(
    N2
);

reactions
{
}
