tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2.5;

// Fixed step (adjustTimeStep off) so the committed baseline is deterministic.
// Solid Courant Us*dt/dx = 0.01*0.0002/0.0001 = 0.02, well within the div
// scheme's stability limit.
deltaT          0.0002;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo      1;

maxDi      5000;

functions
{
    #includeIfPresent "regressionFunctions"

    probes
    {
        type            probes;
        libs            (sampling);
        enabled         true;
        writePrecision  10;
        writeControl    timeStep;
        writeInterval   1;
        fields          (porosityF Ycharm Us Ts);
        probeLocations
        (
            (0.00005 0.0005 0.0005)  // first cell
            (0.00505 0.0005 0.0005)   // quarter channel
            (0.01005 0.0005 0.0005)   // channel midpoint
            (0.01505 0.0005 0.0005)   // near right accumulation
            (0.01995 0.0005 0.0005)   // right wall
        );
    }
}

// ************************************************************************* //
