tutorials/cases/prescribedUsCases/rightWallSolidAccumulationFromLeftInlet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fresh-solid inlet fixture: the empty domain is filled from the left by pure
// char moving in +x. The right wall, top, and bottom have zero solid velocity,
// so the incoming solid must accumulate at the right and grow back toward the
// inlet once the receiver cap is reached.

defaultFieldValues
(
    volScalarFieldValue porosityF  1
    volScalarFieldValue porosityF0 1
    volVectorFieldValue Us         (0.01 0 0)
);

regions
(
);

// ************************************************************************* //
